import React from 'react';
import { Card, Col, Container, Row } from 'react-bootstrap';
import './Style.css';
import sheba1 from '../../../../assets/img/sheba-icon-1.png';
import sheba2 from '../../../../assets/img/sheba-icon-2.png';
import sheba3 from '../../../../assets/img/sheba-icon-3.png';
import sheba4 from '../../../../assets/img/sheba-icon-4.png';
import sheba5 from '../../../../assets/img/sheba-icon-5.png';
import sheba6 from '../../../../assets/img/sheba-icon-6.png';
import sheba7 from '../../../../assets/img/sheba-icon-7.png';

const sebaDetails = [
    {
        _id: 1,
        title: 'এসিসমেন্ট তৈরি করুন',
        icon: sheba1,
        details: [
            { para: '১.ব্যবসা প্রতিষ্ঠানের নামে ব্যাংক একাউন্ট খোলা অত্যান্ত জরুরী, এই একাউন্ট খোলার জন্য ব্যাংক কতৃপক্ষ প্রথমেই ট্রেড লাইসেন্স চাইবে৷' },
            { para: '২.যে কোন ব্যবসায়ীক চুক্তি, এসোসিয়েশনের সদস্য পদ, আমদানি ও রপ্তানী লাইসেন্স,প্রোজেক্ট লোন ইত্যাদির ক্ষেত্রেও প্রয়োজন ৷' },
            { para: '৩.ব্যাবসায়িক পরিচিতি সহ মামলা-মোকদ্দমা পরিচালনায় অনেক সময় প্রয়োজন ৷' }
        ]
    },
    {
        _id: 2,
        title: 'আবাসিক কর আদায়',
        icon: sheba2,
        details: [
            { para: '১.ব্যবসা প্রতিষ্ঠানের নামে ব্যাংক একাউন্ট খোলা অত্যান্ত জরুরী, এই একাউন্ট খোলার জন্য ব্যাংক কতৃপক্ষ প্রথমেই ট্রেড লাইসেন্স চাইবে৷' },
            { para: '২.যে কোন ব্যবসায়ীক চুক্তি, এসোসিয়েশনের সদস্য পদ, আমদানি ও রপ্তানী লাইসেন্স,প্রোজেক্ট লোন ইত্যাদির ক্ষেত্রেও প্রয়োজন ৷' },
            { para: '৩.ব্যাবসায়িক পরিচিতি সহ মামলা-মোকদ্দমা পরিচালনায় অনেক সময় প্রয়োজন ৷' }
        ]
    },
    {
        _id: 3,
        title: 'বাণিজ্যিক  কর আদায়',
        icon: sheba3,
        details: [
            { para: '১.ব্যবসা প্রতিষ্ঠানের নামে ব্যাংক একাউন্ট খোলা অত্যান্ত জরুরী, এই একাউন্ট খোলার জন্য ব্যাংক কতৃপক্ষ প্রথমেই ট্রেড লাইসেন্স চাইবে৷' },
            { para: '২.যে কোন ব্যবসায়ীক চুক্তি, এসোসিয়েশনের সদস্য পদ, আমদানি ও রপ্তানী লাইসেন্স,প্রোজেক্ট লোন ইত্যাদির ক্ষেত্রেও প্রয়োজন ৷' },
            { para: '৩.ব্যাবসায়িক পরিচিতি সহ মামলা-মোকদ্দমা পরিচালনায় অনেক সময় প্রয়োজন ৷' }
        ]
    },
    {
        _id: 4,
        title: 'পাস বহি ',
        icon: sheba4,
        details: [
            { para: '১.ব্যবসা প্রতিষ্ঠানের নামে ব্যাংক একাউন্ট খোলা অত্যান্ত জরুরী, এই একাউন্ট খোলার জন্য ব্যাংক কতৃপক্ষ প্রথমেই ট্রেড লাইসেন্স চাইবে৷' },
            { para: '২.যে কোন ব্যবসায়ীক চুক্তি, এসোসিয়েশনের সদস্য পদ, আমদানি ও রপ্তানী লাইসেন্স,প্রোজেক্ট লোন ইত্যাদির ক্ষেত্রেও প্রয়োজন ৷' },
            { para: '৩.ব্যাবসায়িক পরিচিতি সহ মামলা-মোকদ্দমা পরিচালনায় অনেক সময় প্রয়োজন ৷' }
        ]
    },
    {
        _id: 5,
        title: 'ট্রেড লাইসেন্স ফি আদায়',
        icon: sheba5,
        details: [
            { para: '১.ব্যবসা প্রতিষ্ঠানের নামে ব্যাংক একাউন্ট খোলা অত্যান্ত জরুরী, এই একাউন্ট খোলার জন্য ব্যাংক কতৃপক্ষ প্রথমেই ট্রেড লাইসেন্স চাইবে৷' },
            { para: '২.যে কোন ব্যবসায়ীক চুক্তি, এসোসিয়েশনের সদস্য পদ, আমদানি ও রপ্তানী লাইসেন্স,প্রোজেক্ট লোন ইত্যাদির ক্ষেত্রেও প্রয়োজন ৷' },
            { para: '৩.ব্যাবসায়িক পরিচিতি সহ মামলা-মোকদ্দমা পরিচালনায় অনেক সময় প্রয়োজন ৷' }
        ]
    },
    {
        _id: 6,
        title: 'ইউপির সকল তথ্য MIS এর আওয়াতাভুক্ত করুন  ',
        icon: sheba6,
        details: [
            { para: '১.ব্যবসা প্রতিষ্ঠানের নামে ব্যাংক একাউন্ট খোলা অত্যান্ত জরুরী, এই একাউন্ট খোলার জন্য ব্যাংক কতৃপক্ষ প্রথমেই ট্রেড লাইসেন্স চাইবে৷' },
            { para: '২.যে কোন ব্যবসায়ীক চুক্তি, এসোসিয়েশনের সদস্য পদ, আমদানি ও রপ্তানী লাইসেন্স,প্রোজেক্ট লোন ইত্যাদির ক্ষেত্রেও প্রয়োজন ৷' },
            { para: '৩.ব্যাবসায়িক পরিচিতি সহ মামলা-মোকদ্দমা পরিচালনায় অনেক সময় প্রয়োজন ৷' }
        ]
    },
    {
        _id: 7,
        title: 'সকল কর দাতাদের করমুখি করাই আমাদের মূল উদ্দেশ্য',
        icon: sheba7,
        details: [
            { para: '১.ব্যবসা প্রতিষ্ঠানের নামে ব্যাংক একাউন্ট খোলা অত্যান্ত জরুরী, এই একাউন্ট খোলার জন্য ব্যাংক কতৃপক্ষ প্রথমেই ট্রেড লাইসেন্স চাইবে৷' },
            { para: '২.যে কোন ব্যবসায়ীক চুক্তি, এসোসিয়েশনের সদস্য পদ, আমদানি ও রপ্তানী লাইসেন্স,প্রোজেক্ট লোন ইত্যাদির ক্ষেত্রেও প্রয়োজন ৷' },
            { para: '৩.ব্যাবসায়িক পরিচিতি সহ মামলা-মোকদ্দমা পরিচালনায় অনেক সময় প্রয়োজন ৷' }
        ]
    },
];

const SebasomuhoDetail = () => {
    return (
        <>
            <div className="SebasomuhoDetail-sec">
                <Container>
                    <Row>
                        {
                            sebaDetails.map(sebaDetail => (
                                <Col key={sebaDetail._id} xs={12} sm={6} md={4} className="mb-4">
                                    <Card className="p-4">
                                        <div className="seba-item">
                                            <div className="sheba-detail-img">
                                                <img src={sebaDetail.icon} alt="Not Found!" />
                                            </div>
                                            <h3>{sebaDetail.title}</h3>
                                            <div className="seba-para">
                                                {
                                                    sebaDetail.details.map(detail => (
                                                        <p>{detail.para}</p>
                                                    ))
                                                }
                                            </div>
                                        </div>
                                    </Card>
                                </Col>
                            ))
                        }
                    </Row>
                </Container>
            </div>
        </>
    )
}

export default SebasomuhoDetail;
